Tekla.Structures.Drawing.DrawingObject.NoAttributes
The NoAttributes class defines attributes for objects that do not contain any attributes.

Tekla.Structures.Drawing.DrawingObject.NoAttributes.InitializeDefaultAttributes
Initializes the default attributes.

Tekla.Structures.Drawing.DrawingObject.NoAttributes.#ctor
Creates a new default no attributes instance.

Tekla.Structures.Drawing.DrawingObject.NoAttributes.#ctor(System.String)
Creates a new no attributes instance. No attributes are loaded from the
attribute file as it is not possible to load attributes for objects of
this type.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.DrawingObject.NoAttributes.LoadAttributes(System.String)
It is not possible to load attributes for objects of this type because
the objects have no attributes.
AttributeFile: The filename of the attribute file.
Returns: False because it is not possible to load attributes.

Tekla.Structures.Drawing.DrawingObject.NoAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.